const _my = require("../../__antmove/api/index.js")(my);
// pages/kepuone/kepuone.js
const app = getApp();
Page({
    /**
     * 页面的初始数据
     */
    data: {
        text1:
            "当异物堵塞气管严重时，可导致窒息，甚至死亡，这时候必须得立刻采取有效急救措施。现场急救最为理想的办法是美国医学会推荐的海姆立克腹部冲击法。海姆立克手法适用于自救，也可用于互救。",
        text2:
            "施救者要站在患者的后方，一般采取弓步，前腿放在患者的两腿之间，可以避免患者的位置左右挪动，也可以防止患者因窒息时间过长，导致昏迷、倒地。",
        text21:
            "施救者的双臂从患者的腋下伸到身体前方，右手（利手）握拳，大拇指侧的拳眼，对着患者肚脐向上两横指以上的位置，左手（不利手）抱拳，用向上、向内的力量冲击患者的上腹部。",
        text3:
            "采取坐姿。首先，要让宝宝趴在施救者的左前臂，施救者的胳膊放在腿上，用腿作为支撑。施救者用手托住宝宝的下颌，起到固定和开放气道的作用。让宝宝保持头部略低于胸部的姿态，用右手的掌根部，拍打肩胛中间的区域5次。",
        text4:
            "拍打5次之后，用右手固定孩子的头部，将孩子翻转，注意左手要始终托住宝宝的下颌，起到固定颈椎的作用。翻转后，用左手的食指和中指按压婴儿的胸骨下段5次。重复这两个动作，至异物排出。",
        text5: "有几个细节需要特别注意：",
        text6: "1. 把前臂放在腿上，要让腿承重；",
        text7: "2. 用掌根部拍打背部，而不是按压；",
        text8: "3. 按压胸骨时，手指的方向保持和胸骨平行。",
        text9:
            "如果自己发生呛食，周围又没有其他人能帮助您的时候，可以借助椅子，实施海姆立克急救法来自救。 稍稍弯下腰去，靠在椅背上，以椅背边缘压迫上腹部，快速向上冲击。重复之，直到异物排出。",
        text10:
            "乱用草药如果孕产妇或者是过度肥胖的人出现了呛食，无法从背后环抱患者，施救者可以使用胸部冲击法。与一般的海姆立克急救法相同，施救者站在患者的身后，握拳放在胸骨下段，剑突的上方，而不是上腹部。另一只手抱拳，用向上、向内的力量按压胸骨下端。",
        text11: "因为不痛、不痒、不肿而不去医院做任何治疗",
        text12:
            "需要提醒大家，海姆立克急救法仅在紧急情况下使用！练习海姆立克急救法，初学者一定要在模拟道具人身上进行。如果方法掌握不正确，可能对患者的内脏造成损伤。",
        mag1:
            "cloud://cloud1-1ggve6rwd2654275.636c-cloud1-1ggve6rwd2654275-1309155985/haimp.png",
        barInfo: app.globalData.barInfo
    },

    toNavigate() {
        _my.navigateBack({
            delta: 0
        });
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad: function(options) {},

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady: function() {},

    /**
     * 生命周期函数--监听页面显示
     */
    onShow: function() {},

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide: function() {},

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload: function() {},

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh: function() {},

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom: function() {},

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage: function() {}
});
