const _my = require("../../__antmove/api/index.js")(my);
// pages/kepuone/kepuone.js
const app = getApp();
Page({
    /**
     * 页面的初始数据
     */
    data: {
        text1:
            "“中风”相信大家都不陌生，可以说是中国老年人群的常见病了。但我们也经常听到脑梗、脑卒中、脑溢血这些词，它们之间是啥关系呢？其实，中风只是老百姓的口头语，正规医学名称叫脑卒中，也叫脑血管意外。我们的大脑好比是一块田，田就需要水（也就是血管里的血液）灌溉。当灌水的水渠堵了，庄稼没了水都干死了，也就是脑梗死；当水渠破了，水往外漏，庄稼水太多都淹死了，也就是脑溢血。因此，这几个词语的关系就是：",
        text2:
            "设法把病人抬到床上，注意不要把病人扶起。一般两到三个人同时抬，一个人托住病人的头和肩部，保持头部不受震荡，另一个人托住病人的背部和臀部，还有一个人托住病人的臀部和腿脚部，让病人安静的躺下，头部略高并稍向后仰。",
        text3:
            "解开病人的衣领，让病人的呼吸道保持通畅。如果有呕吐则应该将其头部偏向一侧，以免呕吐物呛入气管内。",
        text4:
            "迅速拨打120急求电话。应把病人送到最近的医院，避免时间、颠簸等原因引起病情加重。",
        text5:
            "尽可能减少不必要的搬运。从楼上往下搬运时，必须保持头在上方，脚在下方，以减少脑部充血，最好用担架让病人平躺着搬运",
        text6:
            "首先要沉着、冷静，正确拨打急救电话“120”，接通“120”后，简要、准确描述患者的性别、年龄、发病现状及所处地点。而在等待救护车过程中，切记以下几点：",
        text7: "1.别过度搬动患者:",
        text8:
            "头部过高可影响脑血流灌注、加重窒息可能、诱发癫痫等。因此，只需将患者平置于地面即可，切勿过度搬动。",
        text9:
            "对于呕吐患者应将头部偏向一侧，解开患者衣领取出假牙，用纱布或手帕垫手上将患者舌头拉向前方，以保持气道通畅，以免呕吐物被吸入气管引起窒息或吸入性肺炎。",
        text10:
            "如果呕吐分泌物阻塞咽喉部，患者出现气急，咽喉部痰声重等症状时，可用细塑料管或橡皮管插入到患者咽喉部，用口吸出分泌物。",
        text11: "2.最好别自己开车:",
        text12:
            "有些人担心救护车来的慢，索性自己开车送患者去医院，这种行为不提倡。",
        text13:
            "转运中风患者，需要许多专业技巧。例如：急救人员能通过现场检查，判断是否为中风患者，如果是，他会马上通知所要送去的医院的卒中抢救人员做好相关准备；救护人员也会在现场对患者的血压、心率、呼吸等生命体征进行检测，保障转运过程安全。",
        text14:
            "如果家离医院很近，病情也不重，或是急救车遇上大堵车，可以考虑自己开车送。但前提是，要与所去的医院急诊科或卒中团队取得联系，以便医院做好应急准备。",
        text15: "3.别喂水或食物:",
        text16:
            "中风患者等待救援时，禁食任何食物、药物，包括喝水。一是因为病人可能合并吞咽困难，二是对于需要急诊手术的患者，进食服药会增加手术麻醉时反胃或误吸风险。",
        text17: "4.别吃降压药:",
        text18:
            "当出现中风症状时，不少老人家的第一反应是“血压高了”，于是赶紧服用降压药。这看似明智的举动，其实也是大误区。这是因为中风时的血压升高，有时是身体的自我保护反应。如大脑缺血时，血压升高有助于让血液有效上升到脑里去。此时降压，适得其反。",
        text19: "5.做好脑卒中抽搐时的保护:",
        text20:
            "脑卒中患者抽搐时，迅速清除患者周围有危险的东西。用手帕包着筷子放入患者口中，以防抽搐发作咬伤舌头。",
        barInfo: app.globalData.barInfo
    },

    toNavigate() {
        _my.navigateBack({
            delta: 0
        });
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad: function(options) {},

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady: function() {},

    /**
     * 生命周期函数--监听页面显示
     */
    onShow: function() {},

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide: function() {},

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload: function() {},

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh: function() {},

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom: function() {},

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage: function() {}
});
