const _my = require("../../__antmove/api/index.js")(my);
// pages/kepuone/kepuone.js
const app = getApp();
Page({
    /**
     * 页面的初始数据
     */
    data: {
        text1:
            "发现小孩误服或过量服用药物后先不要过分紧张，应先弄清楚错服药物的名称、用量等，并留取药物的样品和呕吐物，针对不同的情况采取相应的应急措施，减少药物的吸收，随后送进医院进行处理。",
        text2:
            "若是错服维生素、健胃消食药、滋补药等药物，除非大量服用，一般其不良反应都不会太严重。多饮温开水，让药物稀释排泄，并随时观察。",
        text3:
            "若误喝了碘酒，应立即喝面糊或稠米汤。淀粉与碘作用后，可生成一种稳定的蓝墨水样化合物，此化合物不易被人体吸收。喝完后催吐。",
        text4:
            "如果孩子误食强酸或者强碱液体，这时不宜强行催吐，否则容易造成二次损伤。若为强酸，可服用生蛋清、牛奶等，若为强碱，立即服用食醋、桔汁、柠檬水等，然后及时送医院。",
        text5:
            "切勿轻信网上治病方法.\n此前就有孩子误食农药，家长网上搜索自行买阿托品解毒，最终导致中毒，万幸孩子救治及时，没有酿成大错。",
        text6:
            "药品放在儿童拿不到的地方，用原来的瓶子装好，不要用装食物的瓶子装药",
        text7: "告诉儿童什么是糖果，什么是药，做好教育。",
        text8: "看护好孩子，多一些陪伴",
        text12:
            "研究显示,金环蛇、银环蛇等毒蛇咬伤后,伤口往往不红、不肿、不痛,无出血,或仅有轻微麻痒的感觉。在咬伤后3天左右才出现全身中毒症状,可以致命。所以,蛇咬伤后,一定要去医院接受正规治疗",
        text13:
            "若是误服解热镇痛药、镇咳化痰药、抗菌药、镇静催眠药等药物，用量过大都会产生不同程度的毒副反应，如面色苍白、头晕昏睡或心慌、腹痛等。此时应迅速果断地采取催吐法，促使中毒药物迅速排出，随后将孩子送入医院进行洗胃处理。同时，需要注意催吐时，避免呕吐物误吸入肺，如果已经出现昏迷，则不能催吐！若已发生抽搐，让小孩面部侧向一边，使其呼吸通畅，避免呕吐物误吸，速送医院。",
        text14:
            "无论哪种误食，一定要及时拨打120，离医院比较近的，或者已经吐出来的，也最好到医院检查一遍。尽量将孩子误食的东西或者瓶子带上，以帮助医生更加清楚的判断孩子的病情。",
        barInfo: app.globalData.barInfo
    },

    toNavigate() {
        _my.navigateBack({
            delta: 0
        });
    },

    /**
     * 生命周期函数--监听页面加载
     */
    onLoad: function(options) {},

    /**
     * 生命周期函数--监听页面初次渲染完成
     */
    onReady: function() {},

    /**
     * 生命周期函数--监听页面显示
     */
    onShow: function() {},

    /**
     * 生命周期函数--监听页面隐藏
     */
    onHide: function() {},

    /**
     * 生命周期函数--监听页面卸载
     */
    onUnload: function() {},

    /**
     * 页面相关事件处理函数--监听用户下拉动作
     */
    onPullDownRefresh: function() {},

    /**
     * 页面上拉触底事件的处理函数
     */
    onReachBottom: function() {},

    /**
     * 用户点击右上角分享
     */
    onShareAppMessage: function() {}
});
